---
type: SlabShapeCreaseArrayIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# SlabShapeCreaseArrayIterator

`Autodesk.Revit.DB.SlabShapeCreaseArrayIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SlabShapeCreaseArrayIterator | — | `public SlabShapeCreaseArrayIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |